Revit 2026 API

# IExternalData Interface

---

The base interface for data classes used when executing servers of external services.

**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IExternalData
```
```vb
Public Interface IExternalData
```
```cpp
public interface class IExternalData
```
```fsharp
type IExternalData = interface end
```

Each and every external service defines a concrete class derived from this interface and adds data and methods as it sees fit for executions of such a particular service.

#### Reference

Autodesk.Revit.DB.ExternalService Namespace